html/aws-ec2-instances.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>aws ec2的几种实例</title>
<meta name="author" content="dirtysalt" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content" class="content">
<h1 class="title">aws ec2的几种实例</h1>
<p>
<a href="http://aws.amazon.com/cn/ec2/pricing/">aws ec2 定价</a>
</p>

<p>
专用主机(dedicated-hosts)就不说了，这个应该是物理主机，其他三种实例都是虚拟主机。
</p>
<ul class="org-ul">
<li>专用实例(dedicated-instance). 这个是按需付费，并且每个小时的费用是固定的。适合产品初期，不知道要用多少实例，也不知道要用多久。</li>
<li>竞价实例(spot-instance). 同样是按需付费，但是每个小时的价格是浮动的。只要你的出价高于当时的实例价格，那么实例就可以一直运行，否则就会终止。比较适合离线batch job, 比如运行MapReduce/Spark来做数据分析, 或者跑个caffe做深度学习等。</li>
<li>预留实例(reserved-instance). 预先(up-front)付费.  预先支付越多，那个均摊到每个小时计算费用越低。比较适合产品中后期，知道自己大概需要多少实例，以及要运行多长时间。</li>
</ul>

<p>
这些说的都是计算费用，还有网络传输费用以及存储费用。前面两个按需付费的实例，如果不运行(stop)那么是不会有任何计算费用/网络费用的。但是会收取EBS的费用，因为你的代码和系统都存在EBS上. EBS定价可以看<a href="https://aws.amazon.com/cn/ebs/pricing/">这里</a>
</p>

<hr />

<p>
<a href="https://docs.amazonaws.cn/AmazonS3/latest/dev/aws-usage-report-understand.html">https://docs.amazonaws.cn/AmazonS3/latest/dev/aws-usage-report-understand.html</a>
</p>

<p>
Amazon S3 账单和使用率报告使用代码和缩写。例如，对于在下表中定义的使用类型，region 将被替换为以下缩写之一：
</p>
<ul class="org-ul">
<li>APN1: 亚太区域（东京）</li>
<li>APN2: 亚太区域（首尔）</li>
<li>APS1: 亚太区域（新加坡）</li>
<li>APS2: 亚太区域（悉尼）</li>
<li>APS3: 亚太地区（孟买）</li>
<li>CAN1: 加拿大 (中部)</li>
<li>EUC1: 欧洲（法兰克福）</li>
<li>EU: 欧洲（爱尔兰）</li>
<li>EUW2: 欧洲 (伦敦)</li>
<li>EUW3: 欧洲 (巴黎)</li>
<li>SAE1: 南美洲（圣保罗）</li>
<li>UGW1: AWS GovCloud (US-West)</li>
<li>USE1 (or no prefix): 美国东部（弗吉尼亚北部）</li>
<li>USE2: 美国东部（俄亥俄州）</li>
<li>USW1: 美国西部（加利福尼亚北部）</li>
<li>USW2: 美国西部（俄勒冈）</li>
</ul>

<hr />

<p>
EC2 归一化因子 NormalizationFactor
</p>

<p>
<a href="https://docs.aws.amazon.com/zh_cn/awsaccountbilling/latest/aboutv2/enhanced-lineitem-columns.html">https://docs.aws.amazon.com/zh_cn/awsaccountbilling/latest/aboutv2/enhanced-lineitem-columns.html</a>
</p>

<blockquote>
<p>
lineItem/NormalizationFactor
</p>

<p>
AWS 可将所有区域 Linux 或 Unix Amazon EC2 和 Amazon RDS RI 折扣应用于某个实例系列和 AWS 区域内的所有实例大小，前提是实例具有共享租赁。这也适用于组织中的成员账户的 RI 折扣。对于所有新的及现有 Amazon EC2 和 Amazon RDS 大小灵活的 RI，其大小将根据基于实例大小的标准化因子调整。下表显示 AWS 对每个实例大小应用的标准化因子。
</p>

<p>
适用于 Amazon EC2 大小灵活的 RI 的标准化因子
</p>
</blockquote>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">实例大小</th>
<th scope="col" class="org-right">标准化因子</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">nano</td>
<td class="org-right">0.25</td>
</tr>

<tr>
<td class="org-left">micro</td>
<td class="org-right">0.5</td>
</tr>

<tr>
<td class="org-left">small</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">medium</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">large</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">xlarge</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">2xlarge</td>
<td class="org-right">16</td>
</tr>

<tr>
<td class="org-left">4xlarge</td>
<td class="org-right">32</td>
</tr>

<tr>
<td class="org-left">8xlarge</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-left">10xlarge</td>
<td class="org-right">80</td>
</tr>

<tr>
<td class="org-left">16xlarge</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">32xlarge</td>
<td class="org-right">256</td>
</tr>
</tbody>
</table>

<p>
s, m, l 分别是1, 2, 4, 然后xl, 2xl就是8, 16这个系数
</p>
</div>
</body>
</html>
